{
  "success": true,
  "paper_id": 3,
  "year": 2022,
  "course": "q9",
  "paper_number": 7,
  "filename": "2022-p07-q09-solutions.pdf",
  "extraction_method": "pdfplumber",
  "text_by_page": {
    "1": "— Solution notes — COMPUTER SCIENCE TRIPOS Part IB, Part II 50% – 2022 – Paper 7 9 Further Human–Computer Interaction (afb21) Many people start each day with the same set of actions on their phone, for example, checking the weather forecast, their calendar, looking at updates on Twitter, BBC News, email etc. This question asks you to imagine that you are leading the design team at a phone company, creating an interactive personal assistant that will automate this sequence of tasks. The app will be marketed as an “AI” assistant, but the company has not placed any constraint on what algorithms, representations or interaction techniques will be used. design (a) The initial design budget will support a team of four people working for two ethnography, months to carry out formative research. Explain i) what research methods the analysing members of the team would use, ii) what empirical data they would collect, iii) qualitative data what analytic activities they would carry out, and iv) how the results would be presented. [4 marks] Answer: i) In order to understand the everyday lives of potential users, I would take an ethnographic approach, including interviews and potentially diary studies. This work could be done by researchers trained in social science methods. A member of the team could also carry out online research in user forums, to see whether there is any discussion of routines like this. ii) The resulting data would be qualitative observations and transcribed interview data. If diary studies are included, this data might be time-coded. iii) It would be necessary to use a qualitative data analysis method such as grounded theory to look for patterns in the data. iv) The results could be presented as thematic summaries, supported by examples of specific situations or quotes from the field observations. If any of that data identified study participants, they should give consent in advance, and the company might have an ethical review procedure for such research. design of visual (b) The company has allocated a prototyping budget that will support the displays, models development of two prototype apps using different technical approaches. of decision Describe in general terms two approaches to interaction that would address making this problem. Compare i) the elements of the visual representation that would be required for each, and ii) the cognitive implications for the user in terms of attention and decisions. [8 marks] Answer: The first approach would be to use a machine learning algorithm to construct a model of the repeated tasks that the user might want to automate. The second would be to provide a configurable script that the user can use to specify how they want it to behave. i) Forthescriptapproach,thevisualrepresentationofthescriptwouldincludeelementssuchas the sequence that the events should occur in, along with any dependencies or conditions (for example,someactionsmayonlyberelevantonweekdays). Thisrepresentationcouldusesome conventions from visual programming languages. For the machine learning approach, there shouldbesomewayfortheusertoinspecttheinferredmodel,andideallysomewaytomodify it,forexamplebythesystemmakingasuggestionofwhatactionwillbetakennext,andasking for this to be confirmed or rejected. In both cases, an appropriate visual correspondence to the action being automated would be to use the icon for that app, and then perhaps show a screenshot of a specific touch within that app if relevant. ii) The script approach requires attention investment for the user to decide to automate events, and learn how to do it. It also doesn’t seem much like AI. For that reason, it might be better to automatically prompt the user once an opportunity for automation has been identified. Users might also have some 1",
    "2": "— Solution notes — bias toward accepting this suggestion or not - perhaps based on their familiarity with AI, or perhaps based on whether their friends use it. experiment design (c) Describe how you would carry out a summative evaluation that compares the efficiency of the two prototypes in quantitative terms. [4 marks] Answer: Efficiency could be compared in terms of the time taken to automate tasks using the two prototypes, and accuracy of the tasks being completed as the user intended. I would recruit a sample of representative users, and get them to complete a controlled automation task using a phone that is in a known state to minimise variation. I would compare the mean timebetweenautomationdonewithoneprototypeandtheother,anduseastatisticaltestsuch as the t-test to see whether the difference between means is statistically significant relative to the variance. I would make a similar comparison of errors, where the automation has not been set up as intended. Errors are unlikely to be normally distributed, so a non-parametric test such as the sign test could be used. three waves of (d) Which wave of theoretical development in HCI is best represented by this HCI application concept? If you were to approach this market opportunity from the perspective of a different wave, which one would you choose and why? [4 marks] Answer: The design goal of increasing efficiency is typical of first-wave HCI, as is the use of a quantitative experiment to assess performance. In an industrial context, this kind of comparisonofindividualperformancemightbeconsideredanexampleofTaylorism. Although peopleappreciateefficiencyintheirpersonallives,itdoesnotseemappropriatetouseTaylorist methods. Second wave HCI might focus on how people use their phones and daily routines as one element of their social lives, and perhaps investigate the way that people acquire routines and shortcuts from others that they live with or in their friendship networks. 2"
  }
}