{
  "success": true,
  "paper_id": 1,
  "year": 2022,
  "course": "q8",
  "paper_number": 7,
  "filename": "2022-p07-q08-solutions.pdf",
  "extraction_method": "pdfplumber/PyPDF2/OCR",
  "text_by_page": {
    "1": "— Solution notes — COMPUTER SCIENCE TRIPOS Part IB, Part II 50% – 2022 – Paper 7 8 Further Human–Computer Interaction (afb21) Facebook founder Mark Zuckerberg, after changing the company name to Meta, has announced his intention to increase the market for Oculus VR headsets by replacing many current user interfaces with the “Metaverse” — a virtual reality 3D rendering. In this question, you are asked to imagine that you are responsible for designing a new interactive university, implemented in the Metaverse, called the Metaversity. Designing (a) In the Further HCI course, we argue that complex interaction spaces are like complex systems programming languages, and that design of such spaces can draw on principles as interaction of programming language design. Briefly describe a design idea for the VR spaces Metaversity, and then suggest three aspects of the Metaversity that might be relatedtoaspectsofaprogramminglanguage, explainingforeachonethenature of the analogy. [8 marks] Answer: My idea is that the Metaversity should be designed like an adventure park or fairground, where each course is presented as a separate live experience. Customer feedback onthecoursewouldassesshowenjoyableorentertainingitwas,andadmissionpricescouldbe adjusted to motivate students to take courses that are less enjoyable but still good for them. However, this overall concept might suffer from the same problems as attempts to present operating system concepts with a building metaphor. Aspect 1: Where a course builds conceptually on the content of another course, this could be seenasobject-orientedinheritance,withtheadvancedcoursehavingthesamebasicinterfaces, but a more specialised intepretation of them. Aspect 2: Each student could be seen as an instantiation of the theoretical content that has been delivered in a particular course, and will be epected to behave in a certain way under the operations defined in that course. Examinations could be regarded as testing/verification of the public interface for each instance. Aspect 3: Multiple students taking the same course could be regarded as a single collection entity, with a template interface allowing map operations such as sending all students to an alternative venue, or making agile changes to the curriculum. Design of visual (b) For each of these three aspects, describe how it might be represented displays visually, making reference to principles of correspondence in theories of visual representation. [6 marks] Answer: Aspect 1: the inheritance relationship could be represented in terms of visual containment, with more specialised courses visibly contained inside introductory ones. The structural correspondence of prerequisites would be maintained by the fact that the student has to pass through the outer building to get to the inner one. Aspect 2: the instance relationship could be communicated by a badge that is awarded to graduates of each course, and can be worn on their avatar. This badge could be an iconic symbol (for example, lambda calculus represented by a lambda, or computer graphics by an eyeball), but could also include text as dual encoding, just like with icons on a regular 2D screen. Aspect 3: A collection of students could be represented as a colour encoding, visible only to the lecturer who is invoking the map operation, for example temporarily selecting a group of 1",
    "2": "— Solution notes — studentsbyacategoricalvisualvariablesuchasaddingpinkhighlights,andthenmakingtheir avatars hover in the air before dropping them all in a different location. Cognitive (c) For each of these three aspects, describe a design trade-off that should be Dimensions of considered in terms of the Cognitive Dimensions of Notations. [6 marks] Notations Answer: Aspect 1: There might be a danger of premature commitment if a student wanted to make reference to an advanced course, but was not able to access it without graduating from (walking through) the prequisite area. Some kind of teleporting might be introduced, but this would introduce a hidden dependency. Aspect 2: Visibility is good for other people’s qualifications, but it’s relatively hard to look at your own avatar to see what badges you have earned. There might also be a problem with diffuseness if any of the course names include long text labels, because it might be hard to read a large number of small badges. There is also a problem with juxtaposability, if it was necessary to compare the badges but they had been pinned in different parts of the clothing. Aspect3: Operationonawholecollectiongreatlyreducesviscosity,asyoucanchangethestate of many students at once. Unfortunately, the ’hover’ operation seems slightly error-prone, as it’s possible that students who were inside buildings at the time might be levitated outside the building and be accidentally deregistered from an unrelated course. 2"
  }
}